virtual_plc_project_Arne/virtual_plc_project_Arne/Virtual_plc/docs/Tasks_SequenceDiagram.md
```mermaid
sequenceDiagram
    participant T1 as MorningRoutine
    participant GVL as GlobalVars
    participant T2 as MonitorRoutine

    T1->>GVL: set NeedLunch = TRUE
    T2->>GVL: read NeedLunch
    T2->>GVL: call AddTopping() -> update ToppingCount
    T1->>GVL: call AddTopping() -> update ToppingCount
    T1->>GVL: set ProgramActive = FALSE (end)

```
